package main

import (
	"fmt"
	"math/rand"
	"time"
)

const (
	Yin    int = 0
	Yang   int = 1
	GuaLen     = 6
)

const (
	Qian = 1 // 乾卦
	Kun  = 2 // 坤卦
	Zhen = 3 // 震卦
	Gen  = 4 // 艮卦
	Li   = 5 //  离卦
	Kan  = 6 // 坎卦
	Dui  = 7 // 兑卦
	Xun  = 8 // 巽卦

	YangYao = "—"
	YinYao  = "--"
)

type Yao struct {
	Image     string `json:"image"`     // 爻象
	Text      string `json:"text"`      // 爻辞
	ImageText string `json:"imageText"` // 象辞
}

// 八卦
type BaGua struct {
	Id         int    `json:"id"`
	Name       string `json:"name"`
	Char       string `json:"char"`
	YinYangArr []int  `json:"yinYangArr"`
	Tips       string `json:"tips"`
}

// 卦象： 六十四卦
type GuaImage struct {
	Index   int         `json:"index"`   // 卦序
	Wai     BaGua       `json:"wai"`     // 上卦，外卦
	Nei     BaGua       `json:"nei"`     // 下卦，内卦
	Name    string      `json:"name"`    // 卦名
	DuYin   string      `json:"duYin"`   // 读音
	Text    string      `json:"text"`    // 卦辞
	Extra   string      `json:"extra"`   // 额外信息
	YongYao Yao         `json:"yongYao"` // 如用九、用六
	Short   string      `json:"short"`   // 卦简介
	Desc    string      `json:"desc"`    // 介绍
	Yao     [GuaLen]Yao `json:"yao"`     // 六爻
}

var (
	BaGuaMap = map[int]BaGua{
		Qian: {
			Id:         Qian,
			Name:       "乾(天)",
			Char:       "☰",
			YinYangArr: []int{Yang, Yang, Yang},
			Tips:       "乾三连",
		},
		Kun: {
			Id:         Kun,
			Name:       "坤(地)",
			Char:       "☷",
			YinYangArr: []int{Yin, Yin, Yin},
			Tips:       "坤六断",
		},
		Zhen: {
			Id:         Zhen,
			Name:       "震(雷)",
			Char:       "☳",
			YinYangArr: []int{Yin, Yin, Yang},
			Tips:       "震仰盂", // 下实上虚，形似口朝上的钵盂
		},
		Gen: {
			Id:         Gen,
			Name:       "艮(山)",
			Char:       "☶",
			YinYangArr: []int{Yang, Yin, Yin},
			Tips:       "艮覆碗", // 上实，下虚，形似扣着的碗
		},
		Li: {
			Id:         Li,
			Name:       "離(火)",
			Char:       "☲",
			YinYangArr: []int{Yang, Yin, Yang},
			Tips:       "离中虚",
		},
		Kan: {
			Id:         Kan,
			Name:       "坎(水)",
			Char:       "☵",
			YinYangArr: []int{Yin, Yang, Yin},
			Tips:       "坎中满",
		},
		Dui: {
			Id:         Dui,
			Name:       "兌(澤)",
			Char:       "☱",
			YinYangArr: []int{Yin, Yang, Yang},
			Tips:       "兑上缺",
		},
		Xun: {
			Id:         Xun,
			Name:       "巽xùn(風)",
			Char:       "☴",
			YinYangArr: []int{Yang, Yang, Yin},
			Tips:       "巽下断",
		},
	}

	LiuShiSiGuaMap = map[int]GuaImage{
		1: {
			Index: 1,
			Wai:   BaGuaMap[Qian],
			Nei:   BaGuaMap[Qian],
			Name:  "乾为天",
			DuYin: "qián",
			Text:  "乾：元、亨、利、贞。",
			Extra: "",
			YongYao: Yao{
				Text:      "用九，见群龙无首，吉。",
				ImageText: "《象》曰：用九，天德不可为首也。",
			},
			Short: "象征天，含有“健”的意思，“健”也称为乾卦的卦德。《周易集解》：“言天之体以健为用，运行不息，应化无穷，故圣人则之。欲使人法天之用，不法天之体，故名‘乾’，不名天也”。",
			Desc:  "　　《彖》曰：大哉乾元！万物资始，乃统天。云行雨施，品物流形。大明终始，六位时成，时乘六龙以御天。乾道变化，各正性命，保合大和，乃利贞。首出庶物，万国咸寧。中国古籍全录\n　　《象》曰：天行健，君子以自强不息。\n　　《象》曰：潜龙勿用，阳在下也；见龙在田，德施普也；终日乾乾，反復道也；或跃在渊，进无咎也；飞龙在天，大人造也；亢龙有悔，盈不可久也；用九，天德不可为首也。\n　　《文言》曰：\n　　元者，善之长也；亨者，嘉之会也；利者，义之和也；贞者，事之干也。君子体仁足以长人，嘉会足以合礼，利物足以和义，贞固足以干事。君子行此四德者，故曰：乾，元、亨、利、贞。中国古籍全录\n　　初九曰「潜龙勿用」，何谓也？子曰：「龙德而隱者也。不易乎世，不成乎名，遯世无闷，不见是而无闷。乐则行之，忧则违之，確乎其不可拔，潜龙也。」\n　　九二曰「见龙在田，利见大人」何谓也？子曰：「龙德而正中者也。庸言之信，庸行之谨。闲邪存其诚，善世而不伐，德博而化。《易》曰：『见龙在田，利见大人。』君德也。」\n　　九三曰「君子终日乾乾，夕惕若厉，无咎」何谓也？子曰：「君子进德修业。忠信，所以进德也；修辞立其诚，所以居业也。知至至之，可与几也。知终终之，可与存义也。是故居上位而不骄，在下位而不忧。故乾乾因其时而惕，虽危无咎矣。」\n　　九四曰「或跃在渊，无咎。」何谓也？子曰：「上下无常，非为邪也；进退无恒，非离群也。君子进德修业，欲及时也，故无咎。」\n　　九五曰「飞龙在天，利见大人」，何谓也？子曰：「同声相应，同气相求；水流湿，火就燥，云从龙，风从虎。圣人作而万物覩。本乎天者亲上，本乎地者亲下，则各从其类也。」\n　　上九曰「亢龙有悔」何谓也？子曰：「贵而无位，高而无民，贤人在下位而无辅，是以动而有悔也。」\n　　「潜龙勿用」，下也。「见龙在田」，时舍也。终日乾乾，行事也；或跃在渊，自试也；飞龙在天，上治也；亢龙有悔，穷之灾也。乾元用九，天下治也。\n　　潜龙勿用，阳气潜藏；见龙在田，天下文明。终日乾乾，与时偕行；或跃在渊，乾道乃革；飞龙在天，乃位乎天德；亢龙有悔，与时偕极；乾元用九，乃见天则。\n　　乾元者，始而亨者也；利贞者，性情也。乾始，能以美利利天下，不言所利，大矣哉！大哉乾乎！刚健中正，纯粹精也；六爻发挥，旁通情也；时乘六龙，以御天也。云行雨施，天下平也。\n　　君子以成德为行，日可见之行也。潜之为言也，隱而未见，行而未成，是以君子弗用也。\n　　君子学以聚之，问以辩之，宽以居之，仁以行之。《易》曰：「见龙在田，利见大人。」君德也。\n　　九三重刚而不中，上不在天，下不在田。故乾乾因其时而惕，虽危无咎矣。\n　　九四重刚而不中，上不在天，下不在田，中不在人，故或之。或之者，疑之也，故无咎。\n　　夫大人者，与天地合其德，与日月合其明，与四时合其序，与鬼神合其吉凶。先天而天弗违，后天而奉天时。天且弗违，而况於人乎？况於鬼神乎？\n \n　　亢之为言也，知进而不知退，知存而不知亡，知得而不知丧。其唯圣人乎？知进退存亡而不失其正者，其唯圣人乎！",
			Yao: [6]Yao{
				{
					Image:     YangYao,
					Text:      "初九，潜龙勿用。",
					ImageText: "《象》曰：潜龙勿用，阳在下也。",
				},
				{
					Image:     YangYao,
					Text:      "九二，见龙在田，利见大人。",
					ImageText: "《象》曰：见龙在田，德施普也。",
				},
				{
					Image:     YangYao,
					Text:      "九三，君子终日乾乾，夕惕若厉，无咎。",
					ImageText: "《象》曰：终日乾乾，反復道也。",
				},
				{
					Image:     YangYao,
					Text:      "九四，或跃在渊，无咎。",
					ImageText: "《象》曰：或跃在渊，进无咎也。",
				},
				{
					Image:     YangYao,
					Text:      "九五，飞龙在天，利见大人。",
					ImageText: "《象》曰：飞龙在天，大人造也。",
				},
				{
					Image:     YangYao,
					Text:      "上九，亢龙有悔。",
					ImageText: "《象》曰：亢龙有悔，盈不可久也。",
				},
			},
		},
		2: {
			Index: 2,
			Wai:   BaGuaMap[Kun],
			Nei:   BaGuaMap[Kun],
			Name:  "坤为地",
			DuYin: "kūn",
			Text:  "《坤》：元亨。利牝马之贞。君子有攸往，先迷，後得主，利。西南得朋，东北丧朋。安贞吉。",
			Extra: "",
			YongYao: Yao{
				Text:      "用六，利永贞。",
				ImageText: "《象》曰：用六“永贞”，以大终也。",
			},
			Short: "地载万物，也可使万物归隐，所以坤有归与藏的意思。坤卦是唯一的纯阴卦，是“至柔”、“至静”之卦。充分体现了大地之美，女性之美，阴柔之美。坤为大地，承载万物，顺应天时，化育万物，大地具有宽厚、包容、正直、宏大、安静的胸怀，值得我们好好学习。\n　　坤卦，坤为地卦",
			Desc:  "《彖》曰：至哉坤元，万物资生，乃顺承天。坤厚载物，德合无疆。含弘光大，品物咸亨。牝马地类，行地无疆，柔顺利贞。君子。君子攸行，先迷失道，後顺得常。西南得朋，乃与类行。东北丧朋，乃终有庆。安贞之吉，应地无疆。\n　　《象》曰：地势坤。君子以厚德载物。\n　　初六：履霜，坚冰至。\n　　《象》曰：“履霜坚冰”，阴始凝也，驯致其道，至坚冰也。\n　　六二，直方大，不习，无不利。\n　　《象》曰：六二之动，直以方也。“不习无不利”，地道光也。\n　　六三，含章可贞，或从王事，无成有终。\n　　《象》曰“含章可贞”，以时发也。“或従王事”，知光大也。\n　　六四，括囊，无咎无誉。\n　　《象》曰：“括囊无咎”，慎不害也。\n　　六五，黄裳，元吉。\n　　《象》曰：“黄裳元吉”，文在中也。\n　　上六，龙战于野，其血玄黄。\n　　《象》曰：“龙战于野”，共道穷也。\n　　用六，利永贞。\n　　《象》曰：用六“永贞”，以大终也。\n　　《文言》曰：坤至柔而动也刚，至静而德方，后得主而有常，含万物而化光。坤道其顺乎，承天而时行。积善之家必有余庆，积不善之家必有余殃。臣弑其君，子弑其父，非一朝一夕之故，其所由来者渐矣，由辩之不早辩也。《易》曰：“履霜，坚冰至”，盖言顺也。\n　　“直”其正也，“方”其义也。君子敬以直内，义以方外，敬义立而德不孤。“直、方、大，不习无不利”，则不疑其所行也。\n　　阴虽有美，“含”之以従王事，弗敢成也。地道也，妻道也，臣道也，地道无成而代有终也。\n　　天地变化，草木蕃。天地闭，贤人隐。《易》曰：“括囊，无咎无誉”，盖言谨也。\n　　君子黄中通理，正位居体，美在其中而畅于四支，发于事业，美之至也。\n　　阴疑于阳必战，为其嫌于无阳也，故称“龙”焉。犹未离其类也，故称“血”焉。夫玄黄者，天地之杂也，天玄而地黄。",
			Yao: [6]Yao{
				{
					Image:     YinYao,
					Text:      "初六：履霜，坚冰至。",
					ImageText: "《象》曰：“履霜坚冰”，阴始凝也，驯致其道，至坚冰也。",
				},
				{
					Image:     YinYao,
					Text:      "六二，直方大，不习，无不利。",
					ImageText: "《象》曰：六二之动，直以方也。“不习无不利”，地道光也。",
				},
				{
					Image:     YinYao,
					Text:      "六三，含章可贞，或从王事，无成有终。",
					ImageText: "《象》曰“含章可贞”，以时发也。“或従王事”，知光大也。",
				},
				{
					Image:     YinYao,
					Text:      "六四，括囊，无咎无誉。",
					ImageText: "《象》曰：“括囊无咎”，慎不害也。",
				},
				{
					Image:     YinYao,
					Text:      "六五，黄裳，元吉。",
					ImageText: "《象》曰：“黄裳元吉”，文在中也。",
				},
				{
					Image:     YinYao,
					Text:      "上六，龙战于野，其血玄黄。",
					ImageText: "《象》曰：“龙战于野”，共道穷也。",
				},
			},
		},
		3: {
			Index: 3,
			Wai:   BaGuaMap[Kan],
			Nei:   BaGuaMap[Zhen],
			Name:  "水雷屯",
			DuYin: "tún",
			Text:  "《屯》：元亨，利贞。勿用有攸往。利建侯。",
			Extra: "",
			Short: "屯：卦名，象征事物的初生与萌芽。屯者，物之初生也。故屯象征初生。像种子萌芽，破土而出，萌生、破土多有艰难，所以有“难”义。初生之物应当强根固本，不可轻动。但此时也是王者建功立业的时候，所以应该坚定信念产，积极进取，不可安居无事。",
			Desc:  "《彖》曰：屯，刚柔始交而难生。动乎险中，大亨贞。雷雨之动满盈，天造草昧。宜寻建侯而不宁。\n　　《象》曰：云雷，屯。君子以经纶。\n　　初九，磐桓，利居贞。利建侯。\n　　《象》曰：虽磐桓，志行正也。以贵下贱，大得民也。\n　　六二，屯如邅如，乘马班如。匪寇，婚媾。女子贞不字，十年乃字。\n　　《象》曰：六二之难，乘刚也。十年乃字，反常也。\n　　六三，即鹿无虞，惟入于林中，君子几不如舍，往吝。\n　　《象》曰：“即鹿无虞”，以従禽也。君子舍之，往吝穷也。\n　　六四，乘马班如，求婚媾。往吉，无不利。\n　　《象》曰：求而往，明也。\n　　九五，屯其膏，小，贞吉；大，贞凶。\n　　《象》曰：“屯其膏”，施未光也。\n　　上六，乘马班如，泣血涟如。\n　　《象》曰：“泣血涟如”，何可长也。",
			Yao: [6]Yao{
				{
					Image:     YangYao,
					Text:      "初九，磐桓，利居贞。利建侯。",
					ImageText: "《象》曰：虽磐桓，志行正也。以贵下贱，大得民也。",
				},
				{
					Image:     YinYao,
					Text:      "六二，屯如邅如，乘马班如。匪寇，婚媾。女子贞不字，十年乃字。",
					ImageText: "《象》曰：六二之难，乘刚也。十年乃字，反常也。",
				},
				{
					Image:     YinYao,
					Text:      "六三，即鹿无虞，惟入于林中，君子几不如舍，往吝。",
					ImageText: "《象》曰：“即鹿无虞”，以従禽也。君子舍之，往吝穷也。",
				},
				{
					Image:     YinYao,
					Text:      "六四，乘马班如，求婚媾。往吉，无不利。",
					ImageText: "《象》曰：求而往，明也。",
				},
				{
					Image:     YangYao,
					Text:      "九五，屯其膏，小，贞吉；大，贞凶。",
					ImageText: "《象》曰：“屯其膏”，施未光也。",
				},
				{
					Image:     YinYao,
					Text:      "上六，乘马班如，泣血涟如。",
					ImageText: "《象》曰：“泣血涟如”，何可长也。",
				},
			},
		},
		4: {
			Index: 4,
			Wai:   BaGuaMap[Kan],
			Nei:   BaGuaMap[Zhen],
			Name:  "山水蒙",
			DuYin: "méng",
			Text:  "《蒙》：亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",
			Short: "艮为山，坎为泉，山下出泉。泉水始流出山，则必将渐汇成江河，正如蒙稚渐启，又山下有险，因为有险停止不前，所以蒙昧不明。事物发展的初期阶段，必然蒙昧，所以教育是当务之急，培养学生纯正无邪的品质，是治蒙之道。",
			Desc:  "《彖》曰：蒙，山下有险，险而止，蒙。“蒙亨”，以亨行，时中也。“匪我求童蒙，童蒙求我”。志应也。“初筮告”，以刚中也。“再三渎，渎则不告”，渎蒙也。蒙以养正，圣功也。\n　　《象》曰：山下出泉，蒙。君子以果行育德。\n　　初六，发蒙，利用刑人，用说桎梏，以往吝。\n　　《象》曰：“利用刑人”，以正法也。\n　　九二，包蒙，吉。纳妇，吉。子克家。\n　　《象》曰：“子克家”，刚柔节也。\n　　六三，勿用取女，见金夫，不有躬。无攸利。\n　　《象》曰：“勿用取女”，行不顺也。\n　　六四，困蒙，吝。\n　　《象》曰：“困蒙之吝”，独远实也。\n　　六五，童蒙，吉。\n　　《象》曰：“童蒙”之“吉”，顺以巽也。\n　　上九，击蒙，不利为寇，利御寇。\n　　《象》曰：“利”用“御寇”，上下顺也。",
			Yao: [6]Yao{
				{
					Image:     YinYao,
					Text:      "初六，发蒙，利用刑人，用说桎梏，以往吝。",
					ImageText: "《象》曰：“利用刑人”，以正法也。",
				},
				{
					Image:     YangYao,
					Text:      "九二，包蒙，吉。纳妇，吉。子克家。",
					ImageText: "《象》曰：“子克家”，刚柔节也。",
				},
				{
					Image:     YinYao,
					Text:      "六三，勿用取女，见金夫，不有躬。无攸利。",
					ImageText: "《象》曰：“勿用取女”，行不顺也。",
				},
				{
					Image:     YinYao,
					Text:      "六四，困蒙，吝。",
					ImageText: "《象》曰：“困蒙之吝”，独远实也。",
				},
				{
					Image:     YinYao,
					Text:      "六五，童蒙，吉。",
					ImageText: "《象》曰：“童蒙”之“吉”，顺以巽也。",
				},
				{
					Image:     YangYao,
					Text:      "上九，击蒙，不利为寇，利御寇。",
					ImageText: "《象》曰：“利”用“御寇”，上下顺也。",
				},
			},
		},
		5: {
			Index: 5,
			Wai:   BaGuaMap[Kan],
			Nei:   BaGuaMap[Qian],
			Name:  "水天需",
			DuYin: "xū",
			Text:  "《需》：有孚，光亨。贞吉，利涉大川。",
			Short: "需卦，等待之意。乾为天，坎为云，云气上集于天，待时降雨，为需。需象征需待。物初蒙稚，得养而成，因此也含有需待饮食的意思。需卦给我们的启示最重要的是无论在哪里都要耐心等待，顺应天道，伺机而动，是人生的一种智慧。",
			Desc:  "《彖》曰：“需”，须也。险在前也，刚健而不陷，其义不困穷矣。“需，有孚，光亨，贞吉”，位乎天位，以正中也。“利涉大川”，往有功也。\n　　《象》曰：云上于天，需。君子以饮食宴乐。",
			Yao: [6]Yao{
				{
					Image:     YangYao,
					Text:      "初九，需于郊，利用恒，无咎。",
					ImageText: "《象》曰：“需于郊”，不犯难行也。“利用恒无咎”，未失常也。",
				},
				{
					Image:     YangYao,
					Text:      "九二，需于沙，小有言，终吉。",
					ImageText: "《象》曰：“需于沙”，衍在中也。虽小有言，以终吉也。",
				},
				{
					Image:     YangYao,
					Text:      "九三，需于泥，致寇至。",
					ImageText: "",
				},
				{
					Image:     YinYao,
					Text:      "六四，需于血，出自穴。",
					ImageText: "《象》曰：“需于血，”顺以听也。",
				},
				{
					Image:     YangYao,
					Text:      "九五，需于酒食，贞吉。",
					ImageText: "《象》曰：“酒食贞吉”，以中正也。",
				},
				{
					Image:     YinYao,
					Text:      "上六，入于穴，有不速之客三人来，敬之终吉。",
					ImageText: "《象》曰：“不速之客来，敬之终吉”，虽不当位，未大失也。",
				},
			},
		},
		6: {
			Index: 6,
			Wai:   BaGuaMap[Qian],
			Nei:   BaGuaMap[Kan],
			Name:  "天水讼",
			DuYin: "sòng",
			Text:  "《讼》：有孚窒惕，中吉，终凶。利见大人。不利涉大川。",
			Short: "讼卦，象征争论、诉讼。乾为天，坎为水，天西转与水东流背向而行，像人与人不和而争辩。讼象征争辩争论，含诉讼之义。当不易和解时，便会导致诉讼。应该找有大德大才的人进行决断，不要逞强冒险。",
			Desc:  "《彖》曰：讼，上刚下险，险而健，讼。“讼有孚窒惕，中吉”，刚来而得中也。“终凶”，讼不可成也。“利见大人”，尚中正也。“不利涉大川”，入于渊也。\n　　《象》曰：天与水违行，讼。君子以作事谋始。\n　　初六，不永所事，小有言，终吉。\n　　《象》曰：“不永所事”，讼不可长也。虽“小有言”，其辩明也。\n　　九二，不克讼，归而逋。其邑人三百户，无眚。\n　　《象》曰：“不克讼”，归逋窜也。自下讼上，患至掇也。\n　　六三，食旧德，贞厉，终吉。或従王事，无成。\n　　《象》曰：食旧德，従上吉也。\n　　九四，不克讼，复既命渝。安贞吉。\n　　《象》曰：复即命渝，安贞不失也。\n　　九五：讼，元吉。\n　　《象》曰：“讼，元吉”以中正也。\n　　上九：或锡之鞶带，终朝三褫之。\n　　《象》曰：以讼受服，亦不足敬也。",
			Yao: [6]Yao{
				{
					Image:     YinYao,
					Text:      "初六，不永所事，小有言，终吉。",
					ImageText: "《象》曰：“不永所事”，讼不可长也。虽“小有言”，其辩明也。",
				},
				{
					Image:     YangYao,
					Text:      "九二，不克讼，归而逋。其邑人三百户，无眚。",
					ImageText: "《象》曰：“不克讼”，归逋窜也。自下讼上，患至掇也。",
				},
				{
					Image:     YinYao,
					Text:      "六三，食旧德，贞厉，终吉。或従王事，无成。",
					ImageText: "《象》曰：食旧德，従上吉也。",
				},
				{
					Image:     YangYao,
					Text:      "九四，不克讼，复既命渝。安贞吉。",
					ImageText: "《象》曰：复即命渝，安贞不失也。",
				},
				{
					Image:     YangYao,
					Text:      "九五：讼，元吉。",
					ImageText: "《象》曰：“讼，元吉”以中正也。",
				},
				{
					Image:     YangYao,
					Text:      "上九：或锡之鞶带，终朝三褫之。",
					ImageText: "《象》曰：以讼受服，亦不足敬也。",
				},
			},
		},
		7: {
			Index: 7,
			Wai:   BaGuaMap[Qian],
			Nei:   BaGuaMap[Kan],
			Name:  "",
			DuYin: "",
			Text:  "",
			Short: "",
			Desc:  "",
			Yao: [6]Yao{
				{
					Image:     YinYao,
					Text:      "",
					ImageText: "",
				},
				{
					Image:     YangYao,
					Text:      "",
					ImageText: "",
				},
				{
					Image:     YinYao,
					Text:      "",
					ImageText: "",
				},
				{
					Image:     YangYao,
					Text:      "",
					ImageText: "",
				},
				{
					Image:     YangYao,
					Text:      "",
					ImageText: "",
				},
				{
					Image:     YangYao,
					Text:      "",
					ImageText: "",
				},
			},
		},
	}
)

func main() {
	rand.Seed(time.Now().UnixNano())

	arr := []int{}
	for i := 0; i < 6; i++ {
		tempYinYang := rand.Intn(1)
		arr = append(arr, tempYinYang)
	}

	fmt.Println("《易经》第六卦 讼 天水讼 乾上坎下\n　　讼卦，象征争论、诉讼。乾为天，坎为水，天西转与水东流背向而行，像人与人不和而争辩。讼象征争辩争论，含诉讼之义。当不易和解时，便会导致诉讼。应该找有大德大才的人进行决断，不要逞强冒险。\n　　《讼》：有孚窒惕，中吉，终凶。利见大人。不利涉大川。\n　　《彖》曰：讼，上刚下险，险而健，讼。“讼有孚窒惕，中吉”，刚来而得中也。“终凶”，讼不可成也。“利见大人”，尚中正也。“不利涉大川”，入于渊也。\n　　《象》曰：天与水违行，讼。君子以作事谋始。\n　　初六，不永所事，小有言，终吉。\n　　《象》曰：“不永所事”，讼不可长也。虽“小有言”，其辩明也。\n　　九二，不克讼，归而逋。其邑人三百户，无眚。\n　　《象》曰：“不克讼”，归逋窜也。自下讼上，患至掇也。\n　　六三，食旧德，贞厉，终吉。或従王事，无成。\n　　《象》曰：食旧德，従上吉也。\n　　九四，不克讼，复既命渝。安贞吉。\n　　《象》曰：复即命渝，安贞不失也。\n　　九五：讼，元吉。\n　　《象》曰：“讼，元吉”以中正也。\n　　上九：或锡之鞶带，终朝三褫之。\n　　《象》曰：以讼受服，亦不足敬也。")
}
