package main

import (
	"fmt"
	"github.com/kubernetes/kubernetes/staging/src/k8s.io/apimachinery/pkg/util/rand"
	"time"
)

const (
	Yin    int = 0
	Yang   int = 1
	GuaLen     = 6
)

const (
	Qian = 1 // 乾卦
	Kun  = 2 // 坤卦
	Zhen = 3 // 震卦
	Gen  = 4 // 艮卦
	Li   = 5 //  离卦
	Kan  = 6 // 坎卦
	Dui  = 7 // 兑卦
	Xun  = 8 // 巽卦

	YangYao = "—"
	YinYao  = "--"
)

type Yao struct {
	Image string `json:"image"` // 爻象
	Text  string `json:"text"`  // 爻辞
}

// 八卦
type BaGua struct {
	Id         int    `json:"id"`
	Name       string `json:"name"`
	Char       string `json:"char"`
	YinYangArr []int  `json:"yinYangArr"`
	Tips       string `json:"tips"`
}

// 卦象： 六十四卦
type GuaImage struct {
	Index int         `json:"index"` // 卦序
	Wai   BaGua       `json:"wai"`   // 上卦，外卦
	Nei   BaGua       `json:"nei"`   // 下卦，内卦
	Name  string      `json:"name"`  // 卦名
	Text  string      `json:"text"`  // 卦辞
	Extra string      `json:"extra"` // 额外信息，如用九、用六
	Short string      `json:"short"` // 卦简介
	Desc  string      `json:"desc"`  // 介绍
	Yao   [GuaLen]Yao `json:"yao"`   // 六爻
}

var (
	BaGuaMap = map[int]BaGua{
		Qian: {
			Id:         Qian,
			Name:       "乾(天)",
			Char:       "☰",
			YinYangArr: []int{Yang, Yang, Yang},
			Tips:       "乾三连",
		},
		Kun: {
			Id:         Kun,
			Name:       "坤(地)",
			Char:       "☷",
			YinYangArr: []int{Yin, Yin, Yin},
			Tips:       "坤六断",
		},
		Zhen: {
			Id:         Zhen,
			Name:       "震(雷)",
			Char:       "☳",
			YinYangArr: []int{Yin, Yin, Yang},
			Tips:       "震仰盂", // 下实上虚，形似口朝上的钵盂
		},
		Gen: {
			Id:         Gen,
			Name:       "艮(山)",
			Char:       "☶",
			YinYangArr: []int{Yang, Yin, Yin},
			Tips:       "艮覆碗", // 上实，下虚，形似扣着的碗
		},
		Li: {
			Id:         Li,
			Name:       "離(火)",
			Char:       "☲",
			YinYangArr: []int{Yang, Yin, Yang},
			Tips:       "离中虚",
		},
		Kan: {
			Id:         Kan,
			Name:       "坎(水)",
			Char:       "☵",
			YinYangArr: []int{Yin, Yang, Yin},
			Tips:       "坎中满",
		},
		Dui: {
			Id:         Dui,
			Name:       "兌(澤)",
			Char:       "☱",
			YinYangArr: []int{Yin, Yang, Yang},
			Tips:       "兑上缺",
		},
		Xun: {
			Id:         Xun,
			Name:       "巽xùn(風)",
			Char:       "☴",
			YinYangArr: []int{Yang, Yang, Yin},
			Tips:       "巽下断",
		},
	}

	LiuShiSiGuaMap = map[int]GuaImage{
		1: {
			Index: 1,
			Wai:   BaGuaMap[Qian],
			Nei:   BaGuaMap[Qian],
			Name:  "乾为天",
			Text:  "乾：元、亨、利、贞。",
			Extra: "用九，见群龙无首，吉。",
			Short: "象征天，含有“健”的意思，“健”也称为乾卦的卦德。《周易集解》：“言天之体以健为用，运行不息，应化无穷，故圣人则之。欲使人法天之用，不法天之体，故名‘乾’，不名天也”。",
			Desc:  "　　《彖》曰：大哉乾元！万物资始，乃统天。云行雨施，品物流形。大明终始，六位时成，时乘六龙以御天。乾道变化，各正性命，保合大和，乃利贞。首出庶物，万国咸寧。中国古籍全录\n　　《象》曰：天行健，君子以自强不息。\n　　《象》曰：潜龙勿用，阳在下也；见龙在田，德施普也；终日乾乾，反復道也；或跃在渊，进无咎也；飞龙在天，大人造也；亢龙有悔，盈不可久也；用九，天德不可为首也。\n　　《文言》曰：\n　　元者，善之长也；亨者，嘉之会也；利者，义之和也；贞者，事之干也。君子体仁足以长人，嘉会足以合礼，利物足以和义，贞固足以干事。君子行此四德者，故曰：乾，元、亨、利、贞。中国古籍全录\n　　初九曰「潜龙勿用」，何谓也？子曰：「龙德而隱者也。不易乎世，不成乎名，遯世无闷，不见是而无闷。乐则行之，忧则违之，確乎其不可拔，潜龙也。」\n　　九二曰「见龙在田，利见大人」何谓也？子曰：「龙德而正中者也。庸言之信，庸行之谨。闲邪存其诚，善世而不伐，德博而化。《易》曰：『见龙在田，利见大人。』君德也。」\n　　九三曰「君子终日乾乾，夕惕若厉，无咎」何谓也？子曰：「君子进德修业。忠信，所以进德也；修辞立其诚，所以居业也。知至至之，可与几也。知终终之，可与存义也。是故居上位而不骄，在下位而不忧。故乾乾因其时而惕，虽危无咎矣。」\n　　九四曰「或跃在渊，无咎。」何谓也？子曰：「上下无常，非为邪也；进退无恒，非离群也。君子进德修业，欲及时也，故无咎。」\n　　九五曰「飞龙在天，利见大人」，何谓也？子曰：「同声相应，同气相求；水流湿，火就燥，云从龙，风从虎。圣人作而万物覩。本乎天者亲上，本乎地者亲下，则各从其类也。」\n　　上九曰「亢龙有悔」何谓也？子曰：「贵而无位，高而无民，贤人在下位而无辅，是以动而有悔也。」\n　　「潜龙勿用」，下也。「见龙在田」，时舍也。终日乾乾，行事也；或跃在渊，自试也；飞龙在天，上治也；亢龙有悔，穷之灾也。乾元用九，天下治也。\n　　潜龙勿用，阳气潜藏；见龙在田，天下文明。终日乾乾，与时偕行；或跃在渊，乾道乃革；飞龙在天，乃位乎天德；亢龙有悔，与时偕极；乾元用九，乃见天则。\n　　乾元者，始而亨者也；利贞者，性情也。乾始，能以美利利天下，不言所利，大矣哉！大哉乾乎！刚健中正，纯粹精也；六爻发挥，旁通情也；时乘六龙，以御天也。云行雨施，天下平也。\n　　君子以成德为行，日可见之行也。潜之为言也，隱而未见，行而未成，是以君子弗用也。\n　　君子学以聚之，问以辩之，宽以居之，仁以行之。《易》曰：「见龙在田，利见大人。」君德也。\n　　九三重刚而不中，上不在天，下不在田。故乾乾因其时而惕，虽危无咎矣。\n　　九四重刚而不中，上不在天，下不在田，中不在人，故或之。或之者，疑之也，故无咎。\n　　夫大人者，与天地合其德，与日月合其明，与四时合其序，与鬼神合其吉凶。先天而天弗违，后天而奉天时。天且弗违，而况於人乎？况於鬼神乎？\n \n　　亢之为言也，知进而不知退，知存而不知亡，知得而不知丧。其唯圣人乎？知进退存亡而不失其正者，其唯圣人乎！",
			Yao: [6]Yao{
				{
					Image: YangYao,
					Text:  "初九，潜龙勿用。",
				},
				{
					Image: YangYao,
					Text:  "九二，见龙在田，利见大人。",
				},
				{
					Image: YangYao,
					Text:  "九三，君子终日乾乾，夕惕若厉，无咎。",
				},
				{
					Image: YangYao,
					Text:  "九四，或跃在渊，无咎。",
				},
				{
					Image: YangYao,
					Text:  "九五，飞龙在天，利见大人。",
				},
				{
					Image: YangYao,
					Text:  "上九，亢龙有悔。",
				},
			},
		},
	}
)

func main() {
	rand.Seed(time.Now().UnixNano())

	arr := []int{}
	for i := 0; i < 6; i++ {
		tempYinYang := rand.Intn(1)
		arr = append(arr, tempYinYang)
	}

	fmt.Println("乾（读音qián）：卦名。象征天，含有“健”的意思，“健”也称为乾卦的卦德。《周易集解》：“言天之体以健为用，运行不息，应化无穷，故圣人则之。欲使人法天之用，不法天之体，故名‘乾’，不名天也”。\n　　卦辞：乾：元、亨、利、贞。\n　　爻辞：初九，潜龙勿用。\n　　九二，见龙在田，利见大人。\n　　九三，君子终日乾乾，夕惕若厉，无咎。\n　　九四，或跃在渊，无咎。\n　　九五，飞龙在天，利见大人。\n　　上九，亢龙有悔。\n　　用九，见群龙无首，吉。\n　　《彖》曰：大哉乾元！万物资始，乃统天。云行雨施，品物流形。大明终始，六位时成，时乘六龙以御天。乾道变化，各正性命，保合大和，乃利贞。首出庶物，万国咸寧。中国古籍全录\n　　《象》曰：天行健，君子以自强不息。\n　　《象》曰：潜龙勿用，阳在下也；见龙在田，德施普也；终日乾乾，反復道也；或跃在渊，进无咎也；飞龙在天，大人造也；亢龙有悔，盈不可久也；用九，天德不可为首也。\n　　《文言》曰：\n　　元者，善之长也；亨者，嘉之会也；利者，义之和也；贞者，事之干也。君子体仁足以长人，嘉会足以合礼，利物足以和义，贞固足以干事。君子行此四德者，故曰：乾，元、亨、利、贞。中国古籍全录\n　　初九曰「潜龙勿用」，何谓也？子曰：「龙德而隱者也。不易乎世，不成乎名，遯世无闷，不见是而无闷。乐则行之，忧则违之，確乎其不可拔，潜龙也。」\n　　九二曰「见龙在田，利见大人」何谓也？子曰：「龙德而正中者也。庸言之信，庸行之谨。闲邪存其诚，善世而不伐，德博而化。《易》曰：『见龙在田，利见大人。』君德也。」\n　　九三曰「君子终日乾乾，夕惕若厉，无咎」何谓也？子曰：「君子进德修业。忠信，所以进德也；修辞立其诚，所以居业也。知至至之，可与几也。知终终之，可与存义也。是故居上位而不骄，在下位而不忧。故乾乾因其时而惕，虽危无咎矣。」\n　　九四曰「或跃在渊，无咎。」何谓也？子曰：「上下无常，非为邪也；进退无恒，非离群也。君子进德修业，欲及时也，故无咎。」\n　　九五曰「飞龙在天，利见大人」，何谓也？子曰：「同声相应，同气相求；水流湿，火就燥，云从龙，风从虎。圣人作而万物覩。本乎天者亲上，本乎地者亲下，则各从其类也。」\n　　上九曰「亢龙有悔」何谓也？子曰：「贵而无位，高而无民，贤人在下位而无辅，是以动而有悔也。」\n　　「潜龙勿用」，下也。「见龙在田」，时舍也。终日乾乾，行事也；或跃在渊，自试也；飞龙在天，上治也；亢龙有悔，穷之灾也。乾元用九，天下治也。\n　　潜龙勿用，阳气潜藏；见龙在田，天下文明。终日乾乾，与时偕行；或跃在渊，乾道乃革；飞龙在天，乃位乎天德；亢龙有悔，与时偕极；乾元用九，乃见天则。\n　　乾元者，始而亨者也；利贞者，性情也。乾始，能以美利利天下，不言所利，大矣哉！大哉乾乎！刚健中正，纯粹精也；六爻发挥，旁通情也；时乘六龙，以御天也。云行雨施，天下平也。\n　　君子以成德为行，日可见之行也。潜之为言也，隱而未见，行而未成，是以君子弗用也。\n　　君子学以聚之，问以辩之，宽以居之，仁以行之。《易》曰：「见龙在田，利见大人。」君德也。\n　　九三重刚而不中，上不在天，下不在田。故乾乾因其时而惕，虽危无咎矣。\n　　九四重刚而不中，上不在天，下不在田，中不在人，故或之。或之者，疑之也，故无咎。\n　　夫大人者，与天地合其德，与日月合其明，与四时合其序，与鬼神合其吉凶。先天而天弗违，后天而奉天时。天且弗违，而况於人乎？况於鬼神乎？\n \n　　亢之为言也，知进而不知退，知存而不知亡，知得而不知丧。其唯圣人乎？知进退存亡而不失其正者，其唯圣人乎！")
}
